openfoam_cases/pitzDaily/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

T
{
    boundaryField
    {
        inlet
        {
            type    uniformFixedValue;

            uniformValue
            {
                type    table;

                values
                (
                    (0 1e-12)
                    (0.1 1e-12)
                    (0.10001 20)
                );
            }
        }
    }
}


// ************************************************************************* //
